examples/03_pimpleHFDIBFoamFluidisedBedTests/Alumina_n1250/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleHFDIBFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         3.00;

deltaT         2e-3;

writeControl    adjustableRunTime;

writeInterval   2e-2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression uncompressed;

timeFormat      general;

timePrecision   8;

maxCo           1.0;

maxDeltaT       0.003;

adjustTimeStep  yes;

runTimeModifiable yes;
// ************************************************************************* //
